zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_ll_system.h
/**
  ******************************************************************************
  * @file    stm32mp1xx_ll_system.h
  * @author  MCD Application Team
  * @brief   Header file of SYSTEM LL module.
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    The LL SYSTEM driver contains a set of generic APIs that can be
    used by user:
      (+) Access to DBGCMU registers
      (+) Access to SYSCFG registers

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP1xx_LL_SYSTEM_H
#define STM32MP1xx_LL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx.h"

/** @addtogroup STM32MP1xx_LL_Driver
  * @{
  */

#if defined (SYSCFG) || defined (DBGMCU)

/** @defgroup SYSTEM_LL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Private_Constants SYSTEM Private Constants
  * @{
  */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Constants SYSTEM Exported Constants
  * @{
  */

/** @defgroup SYSTEM_LL_EC_BOOT_PIN SYSCFG Boot Pin code selection
  * @{
  */
#define LL_SYSCFG_BOOT0           SYSCFG_BOOTR_BOOT0       /*!< BOOT0 pin connected to VDD */
#define LL_SYSCFG_BOOT1           SYSCFG_BOOTR_BOOT1       /*!< BOOT1 pin connected to VDD */
#define LL_SYSCFG_BOOT2           SYSCFG_BOOTR_BOOT2       /*!< BOOT2 pin connected to VDD */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_BOOT_PIN_PD SYSCFG Boot Pin Pull-Down code selection
  * @{
  */
#define LL_SYSCFG_BOOT0_PD        SYSCFG_BOOTR_BOOT0_PD    /*!< Enable BOOT0 pin pull-down disabled */
#define LL_SYSCFG_BOOT1_PD        SYSCFG_BOOTR_BOOT1_PD    /*!< Enable BOOT1 pin pull-down disabled */
#define LL_SYSCFG_BOOT2_PD        SYSCFG_BOOTR_BOOT2_PD    /*!< Enable BOOT2 pin pull-down disbaled */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_ANALOG_SWITCH Analog Switch control
* @{
*/
#define LL_SYSCFG_ANALOG_SWITCH_PA0            SYSCFG_PMCSETR_ANA0_SEL_SEL   /*!< PA0 Switch Open */
#define LL_SYSCFG_ANALOG_SWITCH_PA1            SYSCFG_PMCSETR_ANA1_SEL_SEL   /*!< PA1 Switch Open */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_I2C_FASTMODEPLUS SYSCFG I2C FASTMODEPLUS
  * @{
  */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C1        SYSCFG_PMCSETR_I2C1_FMP       /*!< Enable Fast Mode Plus for I2C1      */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C2        SYSCFG_PMCSETR_I2C2_FMP       /*!< Enable Fast Mode Plus for I2C2      */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C3        SYSCFG_PMCSETR_I2C3_FMP       /*!< Enable Fast Mode Plus for I2C3      */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C4        SYSCFG_PMCSETR_I2C4_FMP       /*!< Enable Fast Mode Plus for I2C4      */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C5        SYSCFG_PMCSETR_I2C5_FMP       /*!< Enable Fast Mode Plus for I2C5      */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C6        SYSCFG_PMCSETR_I2C6_FMP       /*!< Enable Fast Mode Plus for I2C6      */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_ETHERNET_PHY Ethernet PHY Interface Selection
* @{
*/
#define LL_SYSCFG_ETH_GMII              0x00000000U          /*!< Enable ETH Media GMII interface */
#define LL_SYSCFG_ETH_MII               0x00100000U          /*!< Enable ETH Media MII interface */
#define LL_SYSCFG_ETH_RGMII             0x00200000U          /*!< Enable ETH Media RGMII interface */
#define LL_SYSCFG_ETH_RMII              0x00800000U          /*!< Enable ETH Media RMII interface */
/**
  * @}
  */


/** @defgroup SYSTEM_LL_EC_ETHERNET_MII Ethernet MII Mode Selection
* @{
*/
#define LL_SYSCFG_ETH_CLK               SYSCFG_PMCSETR_ETH_CLK_SEL           /*!< Enable ETH clock selection */
#define LL_SYSCFG_ETH_REF_CLK           SYSCFG_PMCSETR_ETH_REF_CLK_SEL       /*!< Enable ETH REF clock selection */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TIMBREAK SYSCFG TIMER BREAK
  * @{
  */
#define LL_SYSCFG_TIMBREAK_PVD             SYSCFG_CBR_PVDL    /*!< Enables and locks the PVD connection
                                                                   with TIM1/8/15/16/17 Break Input
                                                                   and also the PVDE and PLS bits of the Power Control Interface */
#define LL_SYSCFG_TIMBREAK_CM4_LOCKUP      SYSCFG_CBR_CLL     /*!< Enables and locks the Cortex-M4 LOCKUP signal
                                                                   with Break Input of TIM1/8/15/16/17 */

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_IO_COMPENSATION SYSCFG I/O compensation cell code selection
  * @{
  */
#define LL_SYSCFG_CELL_CODE               0U                     /*!< Disable Compensation Software Control */
#define LL_SYSCFG_REGISTER_CODE           SYSCFG_CMPCR_SW_CTRL   /*!< Enable Compensation Software Control */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_AXI Master code selection
  * @{
  */
#define LL_SYSCFG_AXI_MASTER0_S1        SYSCFG_ICNR_AXI_M0       /*!< Enable AXI Master access DDR through Slave S1 */
#define LL_SYSCFG_AXI_MASTER1_S1        SYSCFG_ICNR_AXI_M1       /*!< Enable AXI Master access DDR through Slave S1 */
#define LL_SYSCFG_AXI_MASTER2_S1        SYSCFG_ICNR_AXI_M2       /*!< Enable AXI Master access DDR through Slave S1 */
#define LL_SYSCFG_AXI_MASTER3_S1        SYSCFG_ICNR_AXI_M3       /*!< Enable AXI Master access DDR through Slave S1 */
#define LL_SYSCFG_AXI_MASTER5_S1        SYSCFG_ICNR_AXI_M5       /*!< Enable AXI Master access DDR through Slave S1 */
#define LL_SYSCFG_AXI_MASTER6_S1        SYSCFG_ICNR_AXI_M6       /*!< Enable AXI Master access DDR through Slave S1 */
#define LL_SYSCFG_AXI_MASTER7_S1        SYSCFG_ICNR_AXI_M7       /*!< Enable AXI Master access DDR through Slave S1 */
#define LL_SYSCFG_AXI_MASTER8_S1        SYSCFG_ICNR_AXI_M8       /*!< Enable AXI Master access DDR through Slave S1 */
#define LL_SYSCFG_AXI_MASTER9_S1        SYSCFG_ICNR_AXI_M9       /*!< Enable AXI Master access DDR through Slave S1 */
#define LL_SYSCFG_AXI_MASTER10_S1       SYSCFG_ICNR_AXI_M10      /*!< Enable AXI Master access DDR through Slave S1 */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TRIGGER_OUTPUT DBGMCU TRIGGER output direction
  * @{
  */
#define LL_DBGMCU_TRGIO_INPUT_DIRECTION   0U			/*!< Disable External trigger output */
#define LL_DBGMCU_TRGIO_OUTPUT_DIRECTION  DBGMCU_CR_DBG_TRGOEN  /*!< Enable External trigger output */
/**
  * @}
  */

