zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_ll_system.h
/** @defgroup SYSTEM_LL_EC_IWDG DBGMCU IWDG Freeze Watchdog
  * @{
  */
#define LL_DBGMCU_IWDG_FREEZE_1CA7_HALT   0U                    /*!< Freeze Watchdog timer when either CA7 core halt in debug mode */
#define LL_DBGMCU_IWDG_FREEZE_2CA7_HALT   DBGMCU_CR_DBG_WDFZCTL /*!< Freeze Watchdog timer when both CA7 cores halt in debug mode */
/**
  * @}
  */


/** @defgroup SYSTEM_LL_EC_APB1_GRP1_STOP_IP DBGMCU APB1 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB1_GRP1_TIM2_STOP      DBGMCU_APB1_FZ_DBG_TIM2_STOP     /*!< TIM2 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM3_STOP      DBGMCU_APB1_FZ_DBG_TIM3_STOP     /*!< TIM3 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM4_STOP      DBGMCU_APB1_FZ_DBG_TIM4_STOP     /*!< TIM4 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM5_STOP      DBGMCU_APB1_FZ_DBG_TIM5_STOP     /*!< TIM5 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM6_STOP      DBGMCU_APB1_FZ_DBG_TIM6_STOP     /*!< TIM6 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM7_STOP      DBGMCU_APB1_FZ_DBG_TIM7_STOP     /*!< TIM7 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM12_STOP     DBGMCU_APB1_FZ_DBG_TIM12_STOP    /*!< TIM12 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM13_STOP     DBGMCU_APB1_FZ_DBG_TIM13_STOP    /*!< TIM13 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM14_STOP     DBGMCU_APB1_FZ_DBG_TIM14_STOP    /*!< TIM14 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_LPTIM1_STOP    DBGMCU_APB1_FZ_DBG_LPTIM1_STOP   /*!< LPTIM1 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_WWDG1_STOP     DBGMCU_APB1_FZ_DBG_WWDG1_STOP    /*!< WWDG1 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C1_STOP      DBGMCU_APB1_FZ_DBG_I2C1_STOP     /*!< I2C1 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C2_STOP      DBGMCU_APB1_FZ_DBG_I2C2_STOP     /*!< I2C2 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C3_STOP      DBGMCU_APB1_FZ_DBG_I2C3_STOP     /*!< I2C3 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C5_STOP      DBGMCU_APB1_FZ_DBG_I2C5_STOP     /*!< I2C5 SMBUS timeout mode stopped when Core is halted */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB2_GRP1_STOP_IP DBGMCU APB2 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB2_GRP1_TIM1_STOP     DBGMCU_APB2_FZ_DBG_TIM1_STOP     /*!< TIM1 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB2_GRP1_TIM8_STOP     DBGMCU_APB2_FZ_DBG_TIM8_STOP     /*!< TIM8 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB2_GRP1_TIM15_STOP    DBGMCU_APB2_FZ_DBG_TIM15_STOP    /*!< TIM15 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB2_GRP1_TIM16_STOP    DBGMCU_APB2_FZ_DBG_TIM16_STOP    /*!< TIM16 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB2_GRP1_TIM17_STOP    DBGMCU_APB2_FZ_DBG_TIM17_STOP    /*!< TIM17 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB2_GRP1_FDCAN_STOP    DBGMCU_APB2_FZ_DBG_FDCAN_STOP    /*!< FDCAN is frozen while the core is in debug mode */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB3_GRP1_STOP_IP DBGMCU APB3 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB3_GRP1_LPTIM2_STOP     DBGMCU_APB3_FZ_DBG_LPTIM2_STOP   /*!< LPTIM2 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_LPTIM3_STOP     DBGMCU_APB3_FZ_DBG_LPTIM3_STOP   /*!< LPTIM3 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_LPTIM4_STOP     DBGMCU_APB3_FZ_DBG_LPTIM4_STOP   /*!< LPTIM4 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_LPTIM5_STOP     DBGMCU_APB3_FZ_DBG_LPTIM5_STOP   /*!< LPTIM5 counter stopped when core is halted */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB5_GRP1_STOP_IP DBGMCU APB5 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB5_GRP1_I2C4_STOP       DBGMCU_APB5_FZ_DBG_I2C4_STOP     /*!< I2C4 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB5_GRP1_RTC_STOP        DBGMCU_APB5_FZ_DBG_RTC_STOP      /*!< RTC is frozen while the core is in debug mode */
#define LL_DBGMCU_APB5_GRP1_I2C6_STOP       DBGMCU_APB5_FZ_DBG_I2C6_STOP     /*!< I2C6 is frozen while the core is in debug mode */
/**
  * @}
  */
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Functions SYSTEM Exported Functions
  * @{
  */

/** @defgroup SYSTEM_LL_EF_SYSCFG SYSCFG
  * @{
  */

/**
  * @brief  Get boot pin value connected to VDD
  * @rmtoll SYSCFG_BOOTR   BOOTx   LL_SYSCFG_GetBootPinValueToVDD
  * @param  BootPinValue This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_BOOT0
  *         @arg @ref LL_SYSCFG_BOOT1
  *         @arg @ref LL_SYSCFG_BOOT2
  * @retval None
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetBootPinValueToVDD(uint16_t BootPinValue)
{
  return (uint32_t)(READ_BIT(SYSCFG->BOOTR, BootPinValue));
}

/**
  * @brief  Enable boot pin pull-down disabled
  * @rmtoll SYSCFG_BOOTR   BOOTx_PD   LL_SYSCFG_EnableBootPinPullDownDisabled
  * @param  BootPinPDValue This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_BOOT0_PD
  *         @arg @ref LL_SYSCFG_BOOT1_PD
  *         @arg @ref LL_SYSCFG_BOOT2_PD
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableBootPinPullDownDisabled(uint16_t BootPinPDValue)
{
  SET_BIT(SYSCFG->BOOTR, BootPinPDValue);
}

/**
  * @brief  Disable boot pin pull-down disabled
  * @rmtoll SYSCFG_BOOTR   BOOTx_PD   LL_SYSCFG_DisableBootPinPullDownDisabled
  * @param  BootPinPDValue This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_BOOT0_PD
  *         @arg @ref LL_SYSCFG_BOOT1_PD
  *         @arg @ref LL_SYSCFG_BOOT2_PD
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableBootPinPullDownDisabled(uint16_t BootPinPDValue)
{
  CLEAR_BIT(SYSCFG->BOOTR, BootPinPDValue);
}

/**
  * @brief  Set Ethernet PHY interface
  * @rmtoll SYSCFG_PMCSETR   ETH_SEL      LL_SYSCFG_SetPHYInterface
  * @rmtoll SYSCFG_PMCSETR   ETH_SELMII   LL_SYSCFG_SetPHYInterface
  * @param  Interface : Interface This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH_MII
  *         @arg @ref LL_SYSCFG_ETH_GMII
  *         @arg @ref LL_SYSCFG_ETH_RGMII
  *         @arg @ref LL_SYSCFG_ETH_RMII
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetPHYInterface(uint32_t Interface)
{
  MODIFY_REG(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_ETH_SEL_CONF, SYSCFG_PMCCLRR_ETH_SEL_CONF);
  MODIFY_REG(SYSCFG->PMCSETR, SYSCFG_PMCSETR_ETH_SEL_CONF, Interface);
}

/**
  * @brief  Get Ethernet PHY interface
  * @rmtoll SYSCFG_PMCSETR   ETH_SEL      LL_SYSCFG_GetPHYInterface
  * @rmtoll SYSCFG_PMCSETR   ETH_SELMII   LL_SYSCFG_GetPHYInterface
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH_MII
  *         @arg @ref LL_SYSCFG_ETH_RMII
  *         @arg @ref LL_SYSCFG_ETH_GMII
  *         @arg @ref LL_SYSCFG_ETH_RGMII
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPHYInterface(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->PMCSETR, SYSCFG_PMCSETR_ETH_SEL_CONF));
}

/**
  * @brief  Clear Ethernet PHY mode
  * @rmtoll SYSCFG_PMCSETR   ETH_SEL      LL_SYSCFG_ClearPHYInterface
  * @rmtoll SYSCFG_PMCSETR   ETH_SELMII   LL_SYSCFG_ClearPHYInterface
  * @param  Interface : Interface This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH_MII
  *         @arg @ref LL_SYSCFG_ETH_GMII
  *         @arg @ref LL_SYSCFG_ETH_RGMII
  *         @arg @ref LL_SYSCFG_ETH_RMII
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_ClearPHYInterface(uint32_t Interface)
{
  MODIFY_REG(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_ETH_SEL_CONF, Interface);
}

/**
  * @brief  Enable Ethernet clock
  * @rmtoll SYSCFG_PMCSETR   ETH_CLK_SEL       LL_SYSCFG_EnablePHYInternalClock\n
  *         SYSCFG_PMCSETR   ETH_REF_CLK_SEL   LL_SYSCFG_EnablePHYInternalClock
  * @param  Clock : This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH_CLK
  *         @arg @ref LL_SYSCFG_ETH_REF_CLK
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnablePHYInternalClock(uint32_t Clock)
{
  MODIFY_REG(SYSCFG->PMCSETR, (SYSCFG_PMCSETR_ETH_CLK_SEL | SYSCFG_PMCSETR_ETH_REF_CLK_SEL), Clock);
}

/**
  * @brief  Disable Ethernet clock
  * @rmtoll SYSCFG_PMCCLRR   ETH_CLK_SEL       LL_SYSCFG_DisablePHYInternalClock\n
  *         SYSCFG_PMCCLRR   ETH_REF_CLK_SEL   LL_SYSCFG_DisablePHYInternalClock
  * @param  Clock : This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH_CLK
  *         @arg @ref LL_SYSCFG_ETH_REF_CLK
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisablePHYInternalClock(uint32_t Clock)
{
  MODIFY_REG(SYSCFG->PMCCLRR, (SYSCFG_PMCCLRR_ETH_CLK_SEL | SYSCFG_PMCCLRR_ETH_REF_CLK_SEL), Clock);
}


/**
  * @brief  Open an Analog Switch
  * @rmtoll SYSCFG_PMCSETR   ANA0_SEL   LL_SYSCFG_OpenAnalogSwitch
  *         SYSCFG_PMCSETR   ANA1_SEL   LL_SYSCFG_OpenAnalogSwitch
  * @param  AnalogSwitch This parameter can be one of the following values:
  *         @arg LL_SYSCFG_ANALOG_SWITCH_PA0 : PA0 analog switch
  *         @arg LL_SYSCFG_ANALOG_SWITCH_PA1:  PA1 analog switch
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_OpenAnalogSwitch(uint32_t AnalogSwitch)
{
  SET_BIT(SYSCFG->PMCSETR, AnalogSwitch);
}

/**
  * @brief  Close an Analog Switch
  * @rmtoll SYSCFG_PMCCLRR   ANA0_SEL   LL_SYSCFG_CloseAnalogSwitch
  *         SYSCFG_PMCCLRR   ANA1_SEL   LL_SYSCFG_CloseAnalogSwitch
  * @param  AnalogSwitch This parameter can be one of the following values:
  *         @arg LL_SYSCFG_ANALOG_SWITCH_PA0 : PA0 analog switch
  *         @arg LL_SYSCFG_ANALOG_SWITCH_PA1:  PA1 analog switch
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_CloseAnalogSwitch(uint32_t AnalogSwitch)
{
  MODIFY_REG(SYSCFG->PMCCLRR, (SYSCFG_PMCCLRR_ANA0_SEL_SEL | SYSCFG_PMCCLRR_ANA1_SEL_SEL), AnalogSwitch);
}

/**
  * @brief  Enable the Analog GPIO switch to control voltage selection 
  *         when the supply voltage is supplied by VDDA
  * @rmtoll SYSCFG_PMCSETR   ANASWVDD   LL_SYSCFG_EnableAnalogGpioSwitch
  * @note   Activating the gpio switch enable IOs analog switches supplied by VDDA
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableAnalogGpioSwitch(void)
{
  SET_BIT(SYSCFG->PMCSETR, SYSCFG_PMCSETR_ANASWVDD);
}

/**
  * @brief  Disable the Analog GPIO switch to control voltage selection 
  *         when the supply voltage is supplied by VDDA
  * @rmtoll SYSCFG_PMCCLRR   ANASWVDD   LL_SYSCFG_DisableAnalogGpioSwitch
  * @note   Activating the gpio switch enable IOs analog switches supplied by VDDA
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableAnalogGpioSwitch(void)
{
  SET_BIT(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_ANASWVDD);
}

/**
  * @brief  Enable the Analog booster to reduce the total harmonic distortion
  *         of the analog switch when the supply voltage is lower than 2.7 V
  * @rmtoll SYSCFG_PMCSETR   EN_BOOSTER   LL_SYSCFG_EnableAnalogBooster
  * @note   Activating the booster allows to guaranty the analog switch AC performance
  *         when the supply voltage is below 2.7 V: in this case, the analog switch
  *         performance is the same on the full voltage range
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableAnalogBooster(void)
{
  SET_BIT(SYSCFG->PMCSETR, SYSCFG_PMCSETR_EN_BOOSTER);
}

/**
  * @brief  Disable the Analog booster
  * @rmtoll SYSCFG_PMCCLRR   EN_BOOSTER   LL_SYSCFG_DisableAnalogBooster
  * @note   Activating the booster allows to guaranty the analog switch AC performance
  *         when the supply voltage is below 2.7 V: in this case, the analog switch
  *         performance is the same on the full voltage range
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableAnalogBooster(void)
{
  SET_BIT(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_EN_BOOSTER);
}

/**
  * @brief  Enable the I2C fast mode plus driving capability.
  * @rmtoll SYSCFG_PMCSETR   I2Cx_FMP   LL_SYSCFG_EnableFastModePlus\n
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C1
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C2
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C3
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C4
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C5
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C6
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableFastModePlus(uint32_t ConfigFastModePlus)
{
  SET_BIT(SYSCFG->PMCSETR, ConfigFastModePlus);
}

/**
  * @brief  Disable the I2C fast mode plus driving capability.
  * @rmtoll SYSCFG_PMCCLRR   I2Cx_FMP   LL_SYSCFG_DisableFastModePlus\n
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C1
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C2
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C3
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C4
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C5
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C6
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableFastModePlus(uint32_t ConfigFastModePlus)
{
  MODIFY_REG(SYSCFG->PMCCLRR, (SYSCFG_PMCCLRR_I2C1_FMP | SYSCFG_PMCCLRR_I2C2_FMP | SYSCFG_PMCCLRR_I2C3_FMP | SYSCFG_PMCCLRR_I2C4_FMP | SYSCFG_PMCCLRR_I2C5_FMP | SYSCFG_PMCCLRR_I2C6_FMP), ConfigFastModePlus);
}

/**
  * @brief  Enable the Compensation Cell
  * @rmtoll SYSCFG_CMPENSETR   MCU_EN   LL_SYSCFG_EnableCompensationCell
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableCompensationCell(void)
{
  SET_BIT(SYSCFG->CMPENSETR, SYSCFG_CMPENSETR_MCU_EN);
}

/**
  * @brief  Disable the Compensation Cell
  * @rmtoll SYSCFG_CMPENCLRR   MCU_EN   LL_SYSCFG_DisableCompensationCell
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableCompensationCell(void)
{
  SET_BIT(SYSCFG->CMPENCLRR, SYSCFG_CMPENCLRR_MCU_EN);
}

/**
  * @brief  Check if the Compensation Cell is enabled
  * @rmtoll SYSCFG_CMPENSETR   MCU_EN   LL_SYSCFG_IsEnabledCompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledCompensationCell(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CMPENSETR, SYSCFG_CMPENSETR_MCU_EN) == SYSCFG_CMPENSETR_MCU_EN);
}

/**
  * @brief  Get Compensation Cell ready Flag
  * @rmtoll SYSCFG_CMPCR   READY   LL_SYSCFG_IsReadyCompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsReadyCompensationCell(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_READY) == (SYSCFG_CMPCR_READY));
}

/**
  * @brief  Enable the SPI I/O speed optimization when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_SPI   LL_SYSCFG_EnableIOSpeedOptimizeSPI
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIOSpeedOptimizationSPI(void)
{
  SET_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_SPI);
}

/**
  * @brief  To Disable optimize the SPI I/O speed when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLCLRR   HSLVEN_SPI   LL_SYSCFG_DisableIOSpeedOptimizeSPI
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIOSpeedOptimizationSPI(void)
{
  MODIFY_REG(SYSCFG->IOCTRLCLRR, SYSCFG_IOCTRLCLRR_HSLVEN_SPI, SYSCFG_IOCTRLCLRR_HSLVEN_SPI);
}

/**
  * @brief  Check if the SPI I/O speed optimization is enabled
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_SPI   LL_SYSCFG_IsEnabledIOSpeedOptimizationSPI
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIOSpeedOptimizationSPI(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_SPI) == SYSCFG_IOCTRLSETR_HSLVEN_SPI);
}

/**
  * @brief  Enable the SDMMC I/O speed optimization when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_SDMMC   LL_SYSCFG_EnableIOSpeedOptimizeSDMMC
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIOSpeedOptimizationSDMMC(void)
{
  SET_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_SDMMC);
}

/**
  * @brief  To Disable optimize the SDMMC I/O speed when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLCLRR   HSLVEN_SDMMC   LL_SYSCFG_DisableIOSpeedOptimizeSDMMC
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIOSpeedOptimizationSDMMC(void)
{
  MODIFY_REG(SYSCFG->IOCTRLCLRR, SYSCFG_IOCTRLCLRR_HSLVEN_SDMMC, SYSCFG_IOCTRLCLRR_HSLVEN_SDMMC);
}

/**
  * @brief  Check if the SDMMC I/O speed optimization is enabled
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_SDMMC   LL_SYSCFG_IsEnabledIOSpeedOptimizationSDMMC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIOSpeedOptimizationSDMMC(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_SDMMC) == SYSCFG_IOCTRLSETR_HSLVEN_SDMMC);
}

/**
  * @brief  Enable the ETH I/O speed optimization when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_ETH   LL_SYSCFG_EnableIOSpeedOptimizeETH
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIOSpeedOptimizationETH(void)
{
  SET_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_ETH);
}

/**
  * @brief  To Disable optimize the ETH I/O speed when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLCLRR   HSLVEN_ETH   LL_SYSCFG_DisableIOSpeedOptimizeETH
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIOSpeedOptimizationETH(void)
{
  MODIFY_REG(SYSCFG->IOCTRLCLRR, SYSCFG_IOCTRLCLRR_HSLVEN_ETH, SYSCFG_IOCTRLCLRR_HSLVEN_ETH);
}

/**
  * @brief  Check if the ETH I/O speed optimization is enabled
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_ETH   LL_SYSCFG_IsEnabledIOSpeedOptimizationETH
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIOSpeedOptimizationETH(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_ETH) == SYSCFG_IOCTRLSETR_HSLVEN_ETH);
}


/**
  * @brief  Enable the QUADSPI I/O speed optimization when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_QUADSPI   LL_SYSCFG_EnableIOSpeedOptimizeQUADSPI
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIOSpeedOptimizationQUADSPI(void)
{
  SET_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_QUADSPI);
}

/**
  * @brief  To Disable optimize the QUADSPI I/O speed when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLCLRR   HSLVEN_QUADSPI   LL_SYSCFG_DisableIOSpeedOptimizeQUADSPI
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIOSpeedOptimizationQUADSPI(void)
{
  MODIFY_REG(SYSCFG->IOCTRLCLRR, SYSCFG_IOCTRLCLRR_HSLVEN_QUADSPI, SYSCFG_IOCTRLCLRR_HSLVEN_QUADSPI);
}

/**
  * @brief  Check if the QUADSPI I/O speed optimization is enabled
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_QUADSPI   LL_SYSCFG_IsEnabledIOSpeedOptimizationQUADSPI
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIOSpeedOptimizationQUADSPI(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_QUADSPI) == SYSCFG_IOCTRLSETR_HSLVEN_QUADSPI);
}

/**
  * @brief  Enable the TRACE I/O speed optimization when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_TRACE   LL_SYSCFG_EnableIOSpeedOptimizeTRACE
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIOSpeedOptimizationTRACE(void)
{
  SET_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_TRACE);
}

/**
  * @brief  To Disable optimize the TRACE I/O speed when the product voltage is low.
  * @rmtoll SYSCFG_IOCTRLCLRR   HSLVEN_TRACE   LL_SYSCFG_DisableIOSpeedOptimizeTRACE
  * @note   This bit is active only if IO_HSLV user option bit is set. It must be used only if the
  *         product supply voltage is below 2.7 V. Setting this bit when VDD is higher than 2.7 V
  *         might be destructive.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIOSpeedOptimizationTRACE(void)
{
  MODIFY_REG(SYSCFG->IOCTRLCLRR, SYSCFG_IOCTRLCLRR_HSLVEN_TRACE, SYSCFG_IOCTRLCLRR_HSLVEN_TRACE);
}

/**
  * @brief  Check if the TRACE I/O speed optimization is enabled
  * @rmtoll SYSCFG_IOCTRLSETR   HSLVEN_TRACE   LL_SYSCFG_IsEnabledIOSpeedOptimizationTRACE
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIOSpeedOptimizationTRACE(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->IOCTRLSETR, SYSCFG_IOCTRLSETR_HSLVEN_TRACE) == SYSCFG_IOCTRLSETR_HSLVEN_TRACE);
}


/**
  * @brief  Enable the AXI master access DDR through slave S1
  * @rmtoll SYSCFG_ICNR   AXI_Mx   LL_SYSCFG_EnableAXIMasterDDRAccessS1
  * @param  ConfigAxiMaster This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_AXI_MASTER0_S1
  *         @arg @ref LL_SYSCFG_AXI_MASTER1_S1
  *         @arg @ref LL_SYSCFG_AXI_MASTER2_S1
  *         @arg @ref LL_SYSCFG_AXI_MASTER3_S1
  *         @arg @ref LL_SYSCFG_AXI_MASTER5_S1
  *         @arg @ref LL_SYSCFG_AXI_MASTER6_S1
  *         @arg @ref LL_SYSCFG_AXI_MASTER7_S1
  *         @arg @ref LL_SYSCFG_AXI_MASTER8_S1
  *         @arg @ref LL_SYSCFG_AXI_MASTER9_S1
  *         @arg @ref LL_SYSCFG_AXI_MASTER10_S1
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableAXIMasterDDRAccessS1(uint32_t ConfigAxiMaster)
{
  SET_BIT(SYSCFG->ICNR, ConfigAxiMaster);
}

